{
  "nodes": [
    {
      "op": "null", 
      "name": "data/0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_weight", 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "t0_embed", 
      "attr": {
        "input_dim": "4443", 
        "output_dim": "256"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l0_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l0_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l0_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l0_init_h", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l0_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l0_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l0_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[6, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3348", 
      "inputs": [[5, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t0_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8373", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[11, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8372", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[11, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "l0_init_c", 
      "inputs": []
    }, 
    {
      "op": "_mul", 
      "name": "_mul5022", 
      "inputs": [[13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8370", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8371", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[11, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5023", 
      "inputs": [[16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3349", 
      "inputs": [[15, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8374", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5024", 
      "inputs": [[12, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1674", 
      "attr": {"p": "0.2"}, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l1_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l1_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l1_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l1_init_h", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l1_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l1_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l1_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3350", 
      "inputs": [[25, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t0_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8378", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[31, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8377", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[31, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "l1_init_c", 
      "inputs": []
    }, 
    {
      "op": "_mul", 
      "name": "_mul5025", 
      "inputs": [[33, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8375", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8376", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[31, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5026", 
      "inputs": [[36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3351", 
      "inputs": [[35, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8379", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5027", 
      "inputs": [[32, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1675", 
      "attr": {"p": "0.2"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l2_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l2_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l2_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[42, 0, 0], [43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l2_init_h", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l2_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l2_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l2_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3352", 
      "inputs": [[45, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t0_l2_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8383", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[51, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8382", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[51, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "l2_init_c", 
      "inputs": []
    }, 
    {
      "op": "_mul", 
      "name": "_mul5028", 
      "inputs": [[53, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8380", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8381", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[51, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5029", 
      "inputs": [[56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3353", 
      "inputs": [[55, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8384", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5030", 
      "inputs": [[52, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1676", 
      "attr": {"p": "0.2"}, 
      "inputs": [[61, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cls_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cls_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected558", 
      "attr": {"num_hidden": "4443"}, 
      "inputs": [[62, 0, 0], [63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label/0", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "t0_sm", 
      "inputs": [[65, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data/1", 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "t1_embed", 
      "attr": {
        "input_dim": "4443", 
        "output_dim": "256"
      }, 
      "inputs": [[68, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l0_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[69, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l0_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[21, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3354", 
      "inputs": [[70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t1_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8388", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[73, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8387", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[73, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5031", 
      "inputs": [[75, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8385", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8386", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[73, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5032", 
      "inputs": [[77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3355", 
      "inputs": [[76, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8389", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5033", 
      "inputs": [[74, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1677", 
      "attr": {"p": "0.2"}, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l1_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[83, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l1_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[41, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3356", 
      "inputs": [[84, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t1_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8393", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[87, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8392", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[87, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5034", 
      "inputs": [[89, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8390", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8391", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[87, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5035", 
      "inputs": [[91, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3357", 
      "inputs": [[90, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8394", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5036", 
      "inputs": [[88, 0, 0], [95, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1678", 
      "attr": {"p": "0.2"}, 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l2_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[97, 0, 0], [43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l2_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[61, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3358", 
      "inputs": [[98, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t1_l2_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8398", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[101, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8397", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[101, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5037", 
      "inputs": [[103, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8395", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8396", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[101, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5038", 
      "inputs": [[105, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3359", 
      "inputs": [[104, 0, 0], [107, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8399", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5039", 
      "inputs": [[102, 0, 0], [109, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1679", 
      "attr": {"p": "0.2"}, 
      "inputs": [[110, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected559", 
      "attr": {"num_hidden": "4443"}, 
      "inputs": [[111, 0, 0], [63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label/1", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "t1_sm", 
      "inputs": [[112, 0, 0], [113, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data/2", 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "t2_embed", 
      "attr": {
        "input_dim": "4443", 
        "output_dim": "256"
      }, 
      "inputs": [[115, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l0_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[116, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l0_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[82, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3360", 
      "inputs": [[117, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t2_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8403", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[120, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8402", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[120, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5040", 
      "inputs": [[122, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8400", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8401", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[120, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5041", 
      "inputs": [[124, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3361", 
      "inputs": [[123, 0, 0], [126, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8404", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5042", 
      "inputs": [[121, 0, 0], [128, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1680", 
      "attr": {"p": "0.2"}, 
      "inputs": [[129, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l1_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[130, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l1_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[96, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3362", 
      "inputs": [[131, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t2_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[133, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8408", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[134, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8407", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[134, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5043", 
      "inputs": [[136, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8405", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[134, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8406", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[134, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5044", 
      "inputs": [[138, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3363", 
      "inputs": [[137, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8409", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[141, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5045", 
      "inputs": [[135, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1681", 
      "attr": {"p": "0.2"}, 
      "inputs": [[143, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l2_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[144, 0, 0], [43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l2_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[110, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3364", 
      "inputs": [[145, 0, 0], [146, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t2_l2_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8413", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[148, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8412", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[148, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5046", 
      "inputs": [[150, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8410", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8411", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[148, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5047", 
      "inputs": [[152, 0, 0], [153, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3365", 
      "inputs": [[151, 0, 0], [154, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8414", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[155, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5048", 
      "inputs": [[149, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1682", 
      "attr": {"p": "0.2"}, 
      "inputs": [[157, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected560", 
      "attr": {"num_hidden": "4443"}, 
      "inputs": [[158, 0, 0], [63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label/2", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "t2_sm", 
      "inputs": [[159, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data/3", 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "t3_embed", 
      "attr": {
        "input_dim": "4443", 
        "output_dim": "256"
      }, 
      "inputs": [[162, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l0_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[163, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l0_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[129, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3366", 
      "inputs": [[164, 0, 0], [165, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t3_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8418", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[167, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8417", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[167, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5049", 
      "inputs": [[169, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8415", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[167, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8416", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[167, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5050", 
      "inputs": [[171, 0, 0], [172, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3367", 
      "inputs": [[170, 0, 0], [173, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8419", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[174, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5051", 
      "inputs": [[168, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1683", 
      "attr": {"p": "0.2"}, 
      "inputs": [[176, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l1_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[177, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l1_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[143, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3368", 
      "inputs": [[178, 0, 0], [179, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t3_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8423", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[181, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8422", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[181, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5052", 
      "inputs": [[183, 0, 0], [141, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8420", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[181, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8421", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[181, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5053", 
      "inputs": [[185, 0, 0], [186, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3369", 
      "inputs": [[184, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8424", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[188, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5054", 
      "inputs": [[182, 0, 0], [189, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1684", 
      "attr": {"p": "0.2"}, 
      "inputs": [[190, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l2_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[191, 0, 0], [43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l2_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[157, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3370", 
      "inputs": [[192, 0, 0], [193, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t3_l2_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[194, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8428", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[195, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8427", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[195, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5055", 
      "inputs": [[197, 0, 0], [155, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8425", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8426", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[195, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5056", 
      "inputs": [[199, 0, 0], [200, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3371", 
      "inputs": [[198, 0, 0], [201, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8429", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[202, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5057", 
      "inputs": [[196, 0, 0], [203, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1685", 
      "attr": {"p": "0.2"}, 
      "inputs": [[204, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected561", 
      "attr": {"num_hidden": "4443"}, 
      "inputs": [[205, 0, 0], [63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label/3", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "t3_sm", 
      "inputs": [[206, 0, 0], [207, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data/4", 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "t4_embed", 
      "attr": {
        "input_dim": "4443", 
        "output_dim": "256"
      }, 
      "inputs": [[209, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l0_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[210, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l0_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[176, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3372", 
      "inputs": [[211, 0, 0], [212, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t4_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[213, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8433", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[214, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8432", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[214, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5058", 
      "inputs": [[216, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8430", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[214, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8431", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[214, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5059", 
      "inputs": [[218, 0, 0], [219, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3373", 
      "inputs": [[217, 0, 0], [220, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8434", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[221, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5060", 
      "inputs": [[215, 0, 0], [222, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1686", 
      "attr": {"p": "0.2"}, 
      "inputs": [[223, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l1_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[224, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l1_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[190, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3374", 
      "inputs": [[225, 0, 0], [226, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t4_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[227, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8438", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[228, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8437", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[228, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5061", 
      "inputs": [[230, 0, 0], [188, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8435", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[228, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8436", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[228, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5062", 
      "inputs": [[232, 0, 0], [233, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3375", 
      "inputs": [[231, 0, 0], [234, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8439", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[235, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5063", 
      "inputs": [[229, 0, 0], [236, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1687", 
      "attr": {"p": "0.2"}, 
      "inputs": [[237, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l2_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[238, 0, 0], [43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l2_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[204, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3376", 
      "inputs": [[239, 0, 0], [240, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t4_l2_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[241, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8443", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[242, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8442", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[242, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5064", 
      "inputs": [[244, 0, 0], [202, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8440", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[242, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8441", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[242, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5065", 
      "inputs": [[246, 0, 0], [247, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3377", 
      "inputs": [[245, 0, 0], [248, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8444", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[249, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5066", 
      "inputs": [[243, 0, 0], [250, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1688", 
      "attr": {"p": "0.2"}, 
      "inputs": [[251, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected562", 
      "attr": {"num_hidden": "4443"}, 
      "inputs": [[252, 0, 0], [63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label/4", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "t4_sm", 
      "inputs": [[253, 0, 0], [254, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data/5", 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "t5_embed", 
      "attr": {
        "input_dim": "4443", 
        "output_dim": "256"
      }, 
      "inputs": [[256, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l0_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[257, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l0_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[223, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3378", 
      "inputs": [[258, 0, 0], [259, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t5_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[260, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8448", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[261, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8447", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[261, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5067", 
      "inputs": [[263, 0, 0], [221, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8445", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[261, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8446", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[261, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5068", 
      "inputs": [[265, 0, 0], [266, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3379", 
      "inputs": [[264, 0, 0], [267, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8449", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[268, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5069", 
      "inputs": [[262, 0, 0], [269, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1689", 
      "attr": {"p": "0.2"}, 
      "inputs": [[270, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l1_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[271, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l1_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[237, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3380", 
      "inputs": [[272, 0, 0], [273, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t5_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[274, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8453", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[275, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8452", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[275, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5070", 
      "inputs": [[277, 0, 0], [235, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8450", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[275, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8451", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[275, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5071", 
      "inputs": [[279, 0, 0], [280, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3381", 
      "inputs": [[278, 0, 0], [281, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8454", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[282, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5072", 
      "inputs": [[276, 0, 0], [283, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1690", 
      "attr": {"p": "0.2"}, 
      "inputs": [[284, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l2_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[285, 0, 0], [43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l2_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[251, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3382", 
      "inputs": [[286, 0, 0], [287, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t5_l2_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[288, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8458", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[289, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8457", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[289, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5073", 
      "inputs": [[291, 0, 0], [249, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8455", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[289, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8456", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[289, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5074", 
      "inputs": [[293, 0, 0], [294, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3383", 
      "inputs": [[292, 0, 0], [295, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8459", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[296, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5075", 
      "inputs": [[290, 0, 0], [297, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1691", 
      "attr": {"p": "0.2"}, 
      "inputs": [[298, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected563", 
      "attr": {"num_hidden": "4443"}, 
      "inputs": [[299, 0, 0], [63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label/5", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "t5_sm", 
      "inputs": [[300, 0, 0], [301, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data/6", 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "t6_embed", 
      "attr": {
        "input_dim": "4443", 
        "output_dim": "256"
      }, 
      "inputs": [[303, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l0_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[304, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l0_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[270, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3384", 
      "inputs": [[305, 0, 0], [306, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t6_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[307, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8463", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[308, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8462", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[308, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5076", 
      "inputs": [[310, 0, 0], [268, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8460", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[308, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8461", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[308, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5077", 
      "inputs": [[312, 0, 0], [313, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3385", 
      "inputs": [[311, 0, 0], [314, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8464", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[315, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5078", 
      "inputs": [[309, 0, 0], [316, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1692", 
      "attr": {"p": "0.2"}, 
      "inputs": [[317, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l1_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[318, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l1_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[284, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3386", 
      "inputs": [[319, 0, 0], [320, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t6_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[321, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8468", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[322, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8467", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[322, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5079", 
      "inputs": [[324, 0, 0], [282, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8465", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[322, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8466", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[322, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5080", 
      "inputs": [[326, 0, 0], [327, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3387", 
      "inputs": [[325, 0, 0], [328, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8469", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[329, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5081", 
      "inputs": [[323, 0, 0], [330, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1693", 
      "attr": {"p": "0.2"}, 
      "inputs": [[331, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l2_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[332, 0, 0], [43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l2_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[298, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3388", 
      "inputs": [[333, 0, 0], [334, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t6_l2_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[335, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8473", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[336, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8472", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[336, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5082", 
      "inputs": [[338, 0, 0], [296, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8470", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[336, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8471", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[336, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5083", 
      "inputs": [[340, 0, 0], [341, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3389", 
      "inputs": [[339, 0, 0], [342, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8474", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[343, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5084", 
      "inputs": [[337, 0, 0], [344, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1694", 
      "attr": {"p": "0.2"}, 
      "inputs": [[345, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected564", 
      "attr": {"num_hidden": "4443"}, 
      "inputs": [[346, 0, 0], [63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label/6", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "t6_sm", 
      "inputs": [[347, 0, 0], [348, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data/7", 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "t7_embed", 
      "attr": {
        "input_dim": "4443", 
        "output_dim": "256"
      }, 
      "inputs": [[350, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l0_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[351, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l0_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[317, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3390", 
      "inputs": [[352, 0, 0], [353, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t7_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[354, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8478", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[355, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8477", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[355, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5085", 
      "inputs": [[357, 0, 0], [315, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8475", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[355, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8476", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[355, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5086", 
      "inputs": [[359, 0, 0], [360, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3391", 
      "inputs": [[358, 0, 0], [361, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8479", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[362, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5087", 
      "inputs": [[356, 0, 0], [363, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1695", 
      "attr": {"p": "0.2"}, 
      "inputs": [[364, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l1_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[365, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l1_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[331, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3392", 
      "inputs": [[366, 0, 0], [367, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t7_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[368, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8483", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[369, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8482", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[369, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5088", 
      "inputs": [[371, 0, 0], [329, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8480", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[369, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8481", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[369, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5089", 
      "inputs": [[373, 0, 0], [374, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3393", 
      "inputs": [[372, 0, 0], [375, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8484", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[376, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5090", 
      "inputs": [[370, 0, 0], [377, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1696", 
      "attr": {"p": "0.2"}, 
      "inputs": [[378, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l2_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[379, 0, 0], [43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l2_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[345, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3394", 
      "inputs": [[380, 0, 0], [381, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t7_l2_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[382, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8488", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[383, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8487", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[383, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5091", 
